{"meta":{"title":"Hexo","subtitle":"","description":"","author":"Semon","url":"http://mingliang233.com","root":"/"},"pages":[],"posts":[{"title":"学习链接","slug":"学习链接","date":"2021-12-07T16:15:15.308Z","updated":"2021-12-07T16:15:15.308Z","comments":true,"path":"2021/12/08/学习链接/","link":"","permalink":"http://mingliang233.com/2021/12/08/%E5%AD%A6%E4%B9%A0%E9%93%BE%E6%8E%A5/","excerpt":"","text":"https://blog.csdn.net/qq_38762479/article/details/89306984https://blog.csdn.net/u012588160/article/details/100108895https://blog.csdn.net/u010970712/article/details/80042731https://docs.oracle.com/javase/specs/jvms/se14/html/index.htmlhttps://github.com/CyC2018/CS-Notes/blob/master/notes/Java%20%E8%99%9A%E6%8B%9F%E6%9C%BA.md Cs-Noteshttps://www.bilibili.com/read/cv5216534/?spm_id_from=333.788.b_636f6d6d656e74.7 尚硅谷路线图2020https://www.cnblogs.com/onepixel/articles/7674659.html 排序算法https://computer.howstuffworks.com/ram.htm RAM工作原理 http://www.masterraghu.com/subjects/np/introduction/unix_network_programming_v1.3/toc.html Unix网络编程电子书 https://github.com/haiyusun/coding-interviews 剑指offer答案","categories":[],"tags":[]},{"title":"《百年大事渾如夢》","slug":"中国百年预言诗","date":"2020-08-26T06:46:25.000Z","updated":"2020-08-26T06:46:25.000Z","comments":true,"path":"2020/08/26/中国百年预言诗/","link":"","permalink":"http://mingliang233.com/2020/08/26/%E4%B8%AD%E5%9B%BD%E7%99%BE%E5%B9%B4%E9%A2%84%E8%A8%80%E8%AF%97/","excerpt":"","text":"宣化上人講步虛大師「中國百年預言詩」 宣化上人開示 一九九三年一月十六日 開示於台灣板橋台北縣立體育館 宣公上心曾於多次大型法會及一般訪問、會談中， 詳盡地剖析步虛大師的「中國百年預言詩」， 其因何在？ 歷史猶如一面明鏡， 先人所以欲令子孫鑑古知今， 避免重蹈覆轍， 藉之改往修來者， 意在斯乎！ 各位善知識：我們各位多數是中國人，我們應該知道中國近百年來的風雲人物，和一切發生的大事。我想我們雖然是佛教徒，也不能不關心國家的大事，也不能不關心個人家庭的大事，也不能不關心自己身體的健康。因為這個，我曾經在洛杉磯講過，在其它的地方也講過，現在回到台灣，我也想把中國近代一百年的事情，對大家稍微描述一下，稍微作一個解釋。 我們學佛的人不能沒有國，不能沒有家，也不能沒有自身。因為自身是學佛的一個本錢﹔家呢？家庭是我們生命的一個發源地﹔這國呢？我們不論出家人、在家人，都要受國家、受政府來保護。所以我們都應該對國要盡忠，對家要盡孝，對一切的人，我們應該用這個「信」字，「信為道元功德母，長養一切諸善根」，所謂「人無信不立」，所以必須要有信。 在家庭若不盡孝，倫常就給乖舛了，所以必須要盡孝，所謂「男女居室，人之大倫，君子之道，肇端乎夫婦。」所謂「君子務本，本立而道生，孝弟也者，其為人之本歟！」 那麼國、政府保護著我們，要有相當的國防、相當的人來保衛國家。我們自身處世為人應該有一個信用，不可以沒有信。孔老夫子說過：「人而無信，不知其可也？」人要是不講信義啊，不知道這個人他能做什麼？所以這個「信」對我們也是要緊的。那麼對國要忠，對家要孝，對個人要注意自己的健康，就免得給國家添累贅。 我曾經講過幾次，講這個中國近百年的大事和風雲的人物。那麼近百年這個風雲人物是很多的，不過我們選出幾個講一講。 這個是誰講的呢？ 這個可以説是預言， 這是在光緒三十年的時候， 北 京西山碧雲寺清虛樓的主人高靜涵 老居士， 他因為關心國家的大事，就請這個扶鸞， 請得隋朝步虛大師降諭。這步虛大師是在中國隋朝的 時候， 因為國家昏亂， 混亂， 蜂賊 肆起 , 那麼人人都想找這個桃源避 秦。 這一位步虛和尚本來是一個大 將軍， 殺了很多人， 可是他覺得這是不對的， 所以他就隱遁了； 一隠 遁了， 就跑到這個天臺山去修行，所以他寫了一首詩， 這一首詩這樣 說的， 説： 昔因隋亂采菩提, 誤入天台石寶西, 朝飲流霞且止渴, 夜餐玉露略充飢, 面壁九年垂大道, 指彈十代換新儀, 欲我辟途途誤我, 天機難洩 洩 禪機。 「昔日隋亂採菩提」，他當時是隋朝的一個將領，覺得隋朝不可收拾了，於是乎他就發心去修道了。修道，他就也沒什麼目的地，就各處遊走。所以他說昔因隋亂採菩提，採取這個菩提大道，就是找修道的地方。 在這找修道地方的期間，「誤入天臺石鼓西」， 他也不知不覺 就走到天臺山石鼓西邊那麼一個地 方，那兒有個山洞，他就在那裏修 行了。 「朝飲流霞且止渴」，他在山裏頭修行，那麼也是苦修，一早起他就稍微飲這個流霞。流霞，也就是一早起在天上太陽剛要出來的時候那種紅霞，好像霞光萬道，瑞氣千條那種的光華，也可以說是「日精月華」。且止渴，那麼他在那兒修行，就餓一點也不要緊，所以就稍微飲一點，止一止渴就夠了。「夜餐玉露略充飢」，那麼睌間就吃一點露水，也就解一解這個飢餓，雖然吃不飽，但是也可以維持這個生命活着。 他就這麼樣子説。 「面壁九年垂大道」，他說他在山上那兒面壁九年，坐了九年，涵養這個道胎，修得明心見性。垂大道，就是大道已經將要成了。「彈十代換新儀」，指彈，就是彈指。因為他這都是對著的，前邊他說面壁九年垂大道，後邊他就說指，這個「指對著「面」。彈，這麼一彈指間哪，覺得很短的一個時間，這個指彈十代，就有十代了，換十個朝代，換十個國家的領導者。十代大約是唐、宋、元、明、清， 這是五代，再加上五代殘唐， 這已經十代了。換新儀，新就是換新的禮儀，換新的儀式。每一個朝代有每 一個朝代的禮法不同，所以都換新 的這種禮儀，這種規矩。 「欲我闢途途誤我」，這是欲我。欲，就是你們大家想要我給你們開一條道路，說明白將來是怎麼回事？這個世局是怎樣？可是我也是因為不明白，我才去修行。途誤我，我也不一定知道。可是「天機難洩洩禪機」，你問我這個天機，這不可以洩漏的，洩漏天機這是有罪的。所以天機難洩，我洩禪機，我説一點預言。這個禪機就是預言，沒有到將來的事情，我可以略略的説一說。這個預言是說的中國這些個風雲人物， 這已經都證實是靈驗的 ， 可是當時說出來， 沒有人知道是 誰？ 他因含而不露， 說一些個隱語 , 像猜謎似的， 就你自己來猜。 頭一個是說的誰呢？ 就是說的這個清朝的末帝宣統皇，這一個故事怎麼說的呢？就說： 雲暗暗，霧愁愁，龍歸泥土塑獼猴， 三歲孩童三載福，月下無主水空流， 萬頃煙波一旦收。 「雲暗暗」雲在那兒非常黑暗.「霧愁愁」 這有一種的霧，也憂愁的樣子。這雲暗暗，霧愁愁，也就是沒有真理了，這個時候，陰人當政。陰人就是說着這個暗，就是説西太后。這西太后垂簾訴政的時候，日月都無光了， 就像沒有太陽了似的， 所以雲也暗了， 霧也愁了。為什麼呢？因為「龍歸泥土塑獼**𤠣」**，這個時候，那個光緒死了，這個龍鑽到土裏去了，因為龍歸這個土，當然也就變泥土了； 活龍變成泥土了， 就沒有龍了， 也就是沒有皇帝了， 沒有天子了，龍變了泥土。 塑獼猴， 用土來塑一個獼𤠣， 在這兒耍猴子。 這個猴子是誰呢？ 就是清朝最後的皇帝宣統。 「三歲孩童三載福」，這時候就拿出一個好像傀儡，來做皇帝。這個小孩只有三歲，就登基坐殿，做皇帝了。你説三歲的小孩子會做皇帝，這豈不是做戲了嗎？這豈不是開玩笑嗎？ 那麼宣統登基那一天，有攝政王在他後邊抱著他做皇帝，可是這個小孩子很不識時務的，坐到殿上就哭。大約他覺得三㱑做皇帝沒有什麼味道，也沒有什麼東西好玩，玩具也沒有；那時候也沒有玩具槍，他也不會砰砰砰，所以他就哭了。哭了，這個攝政王就對他說：「你不要哭，一會兒就完了。」這可以説也是個讖語，像抽籤似的。你們各位想一想，一會兒就完了，就是很短的時間就沒有了，就finish（完了），這就說明了這個宣統做皇帝不久，所以說一會兒就完了，也可以説是清朝快完了的一個預兆，這是所謂不吉祥的話。中國廣東人，你若說不吉祥話，他就給念「大吉利市」、「大吉利市」，就這麼迷信。所以這個呢？也就是大吉利市。這樣子，二歲孩童三載福，他有三年的福報，只能做三年，這三年就是一會兒，三年就沒有了，這是一會兒就完了。 那麼這完了，怎麼樣子啊？下邊這一句說得很清楚，説「月下無主水空流」，這個月下無主，沒有這麼一個字；可是月上呢？有個「主」字。本來這個月上有個「主」字，旁邊有三奌水，這是清朝的一個「清」字。他説月下無主，這就是教你想到那個月的上邊去，所以月上沒有主。可是他不能這麼明顯說，不能説月上沒主；若月上沒主，你就明白了，是個「清」字。「水空流」，空流就是沒有水了，水都流乾了， 沒有了。 這個水乾了， 就是清朝完了。 三點水乾了， 又月下也無主了， 這主跑到月上去了， 這是個清朝的「清」字。 當時雖然是在光緒三十年那時候，可是也沒人懂。到今天為止，恐怕也沒有什麼人懂。所以「月下沒主水空流」，月下也沒有主，月上也沒有主，再沒有水，這清朝跑到什麼地方去了？你們各位來參一參這個字，這是清朝告終了，壽終正寢了，這個「清」字就沒有了。 清朝壽終正寢，所以下邊這是說出從誰的手𥚃丟的呢？說「萬頃煙波一旦收」，萬頃煙波，這就是說萬裡江山就沒有了，可是有一天就結束了，就要改朝改帝了。這一旦説是一天，一天就完了。可是「一旦這兩個字，就是宣統的「宣」字，上邊沒有「宀」字蓋兒，底下是一個「亘」字；這「亘」字把它分開來，就是「一旦」兩個字。他不能說：喔！宣休了。就說一旦休，就教你猜這個字義，裏邊有一個含義，就是「宣統」。一旦，就是有一天就結束了，這宣統皇帝是這樣子。以后日本又拿他當傀儡，成立滿洲國，國號叫康德。那麼這滿洲國和大清、民國就不同了，這是宣統皇帝大略的故事。 第二個是講的誰呢？第二段就講的我們孫國父。孫國父怎麼說的呢？就說： 君作祖，質彬彬，萬裡長虹破浪征， 黃鶴樓中吹玉笛，八方齊奏凱歌吟， 旌旗五色換新新。 「君作祖」，「君」就是你，說你就是祖宗了。你是祖宗，當然就要有孫子來，才能做祖宗，這就隱藏一個「孫」字。下一句說的「質彬彬」，這個「質彬彬」不是一句話，隻是半句話，在《論語》上講：「文質彬彬，然后君子。」那不說這個「文」字，這個「文」字藏到后面，你懂得的，一猜就可以猜出來是「孫文」兩個字，所以叫質彬彬。 「萬裡長虹破浪征」，萬裡長虹，這是說的孫國父為革命來奔走呼號，從檀香山坐著船到中國，從中國又坐船到檀香山，在海上這麼乘風破浪地來創革命，就好像在海上一道長虹，所以說「萬裡長虹浪征」。 因為這個萬里長虹應該在天上的。可是他破浪征， 就知道这是坐著船在海裏頭， 乘風破浪， 這叫破浪征。 「黃鶴樓中吹玉笛」， 在湖北武昌， 有黃鶴樓， 在黃鶴樓這個樓上吹起號角來， 要黎元洪創革命， 那麼來幫著孫國父破浪征， 推倒滿清， 成立民國，這叫黃鶴樓中吹玉笛， 這是吹起號角來了。 「八方齊奏凱凱歌吟」，在武昌起義的時候，這一起義，四面八方都響應，風起雲湧地響應這革命，都凱歌吟。 「旌期五色換新新」，這個時候最初立國，中華民國是五色旗，那麼以後才改這個青天白日旗。這是第二個，講的是孫國父武昌起義的事情。 我們人哪， 「有道是真富貴， 無德乃清貧」， 所以「道德」這兩個字並不是腐儒之談，它有至理名言、 有真理在裏頭包藏著。 以中國得天下來論， 掌國家來論， 就是有德者居之， 無德者就失之。 在前面講到中國近一百年來的風雲人物，有的說是像曇華一現就完了，為什麼呢？就是因為沒有德行。沒有德行的人雖然得天下，可是他守不住天下；有德行的人，他雖然沒有天下，而能得到天下人心的歸附，所以這個道德是要緊的。 古人又說過：「徳者， 本也； 財者， 末也， 外本內末， 爭民施奪。」你要是把這根本忘了， 你就只知道去找這個金錢， 你得到了， 可是沒有德行，也會被其他人給你奪去。 你若有德行， 人心歸附， 然後你能有永遠的一種享受。 譬如清朝那個宣統，這德行沒有了，所以道也沒有了，「清」就沒有了。那麼孫國父他是在中國創革命的，可是他也有智無福，也是德行不夠，所以革命成功，又被袁世凱給搶去了。那麼下面第三個我們就說袁大總統袁皇帝。他這是這麼樣説的，說： 吉士懷柔，三十年變，豈凡人哉？曇華一現，南北東西，龍爭虎戰，七八數定，山川粗奠。 「吉士懷柔」，這個吉士，「士」字是語助詞。「懷柔」這是「柔」字是軟的意思。那麼按著字義來講，說這一定是有一個很淸亷的官，這叫吉士；懷柔，他去安撫叛逆去了。不是!「懷柔」這是「懷」字底下那一半，不是全的「懷」字。 吉字下邊， 加上懷字下邊那個好像個衣字似的， 沒有一奌一橫， 這是個袁字。 這吉士懷柔把它解釋清楚， 就是個「袁」字。 「三十年變」，按這個字義來解釋，一般的人以為三十年就有什麼變化了，其實不是，是什麼呢？就是「卅」底下再加「一」橫，這就是個「世」字。下一句就説「豈凡人哉」，若照句讀來講，說這個人不個是凡人。可是也不是這樣子，不是這個意思。「豈」字加一個「凡」字，這就是個「凱」字。綜合上邊「吉士懷柔，三十年變，豈凡人哉」這幾句話合起來，就是「袁世凱」三個字。所以若沒有到的時候，誰也不知道有個袁世凱； 等到的時候， 誰也不知道袁世凱。 那麼不知道， 所以叫預言， 那麼預言經過人這麼推敲就知道， 這是「袁世凱」三個字。 「曇華一現」， 怎麼樣叫曇華一現？ 就是時間很短的，這叫曇華一現。 這就是說的袁世凱也因為不夠德行， 就做皇帝做了八十三天； 八十三天皇帝， 這等於曇華一現似的。 「南北東西， 龍爭虎戰」， 當時袁世凱的時候 — 洪憲時代， 南京就有馮國璋， 北京就有段祺瑞， 西京又有誰， 東京又有誰。 在這個時候， 軍閥割據，這些個人都想各霸一方， 爭這個國家， 所以就在那兒南北東西， 龍爭虎戰， 所謂「八仙過海， 各顏神通」了。 那麼這個時候要有多久呢？ 「七八數定」，七八不是七年、八年這個意思，或者七、八、五十六、也不是的！就是七年加八年，是十五年。不是民國七年、民國八年，它是七、八，十五年，就是北代成功，七八數定，己經在那兒早就預定了。 「山川粗奠」，這時候中國才有一點平安、安寧了。 第四個就輪到我們蔣總統了，這怎麼說的呢？就說： 干戈起，逐鹿忙， 草莽英雄將出山， 多少枕戈豪杰士，風雲聚會到江南， 金陵日月又重光。 「干戈起，逐鹿忙，草莽英雄將出山」，干戈就是作戰了，你一刀，我一槍，這叫做干戈起。這一段文是說的軍閥割據的時候，這叫做干戈起。逐鹿忙，都想逐鹿中原，都想稱王稱霸，都想擁有中國的領土。或者做總統， 或者做主席， 或者做委員長， 都有逐鹿中原的這種野心。 我們注意這個「草莽英雄」，草莽英雄將出山，這裏邊就是寓意，它含義就是說蒋總統。因為蔣總統的姓上邊是個「艸」字頭，底下是將來的「將」，這是蔣總統出山了，他草莽英雄將出山，就到這兒來平定這個天下。平定天下， 所以「多少枕戈豪傑士， 風雲聚會到江南， 金陵日月又重光」，這是說蔣總統北伐成功了。中國當時軍閥各霸一方，那麼蔣總統來把它平息了，所以說草莽英雄將出山。 「多少枕戈豪傑士」，有多少的英雄豪傑在那兒互爭長短，都逐鹿中原。 「風雲聚會到江南」，這時侯，就都到南京去了，中國這一些英雄豪傑都在一起，到南京了，就風雲聚會到江南，江南就是南京。「金陵曰月又重光」，金陵，也是南京一個的別名。這時侯，金陵這兒又好像日月都露出來了，不那麼黑暗了，又有太陽了，在南京又見光明了。這是說的，在清朝光緒三十年，早就注定了這個蔣總統要出來治理天下。 可是中國的人民大約殺業太重了，所以不能享受風調雨順、國泰民安這種的幸福。 於是乎自己國家才內亂平定差不多， 可是外侮又來了。 外侮是什麼呢？ 就是曰本人。 日本人哪，幾千年以來，就要把中國給吃了，它那個地方賣的藥，給那個藥的名字叫什麼名字呢？就叫輕快丸。這個輕快丸，本來是丸散膏丹的「丸」，快就是很快的那個「快」。可是這個音，和很快完了，就是一會兒就完了那個「完」字，是一個音。他這個藥，人一有了毛病就去買輕快丸去，吃了輕快丸，它的影射就是清朝快完了。你看！日本這個野心是很久就存了，就要吞中國。他吃這輕快丸，病就好了，這意思就說，我們若把這個清朝拿下來，佔領中國了，我們大家就都不會有病了，不會有什麼病呢？不會有餓病了，就把這個飢餓的病都給治好了。所以這是輕快丸。還有他做那個燒餅子、饅頭、麻花、點心這種東西，他不叫點心，叫什麽呢？他說这是「中國」，拿這個點心、饅頭、凡是吃的東西，都是中國，這就是吃中國，拿起來就吃中國。這個就是灌輸人的腦筋，我將來要吃中國，就這樣子。 所以這個預言這麼說的， 說是： 瀛洲虎，渡海狼，滿天紅日更昏黃， 莽莽神州傷破碎， 蒼生到處哭爺娘， 春雷乍響見晴陽。 「𤅀洲虎」，這個言其日本人在𤅀洲那個地方，好像一隻老虎似的，所以說𤅀洲虎。提起日本，雖然它是一個小國家，可是國聯，對它都怕三分，都怕它，為什麼呢？它勇敢，它勇猛，不怕死。當時，那是在二次大戰以前，那叫國聯，不是一聯合國。國聯有一次，在什麼時候，我也不是孝古家，也不是研究歷史的，不過就有這麼一次，軍隊都在船上來演習，英國、法國、德國、美國，什麼國家的軍隊，都在自己那船上演習。演習，那個教官就招呼「開步走」，這個軍隊乒乓在那個船上就往前走，其他國家的軍隊到那個船邊上，就是在那兒腳抬起來，落下，抬起來，落下，不往前邁歩，就是那麼起來，落下，起來，落下。可是日本的軍隊怎麼樣啊？到那個船邊上，就住那個海裏走，不怕死。這一下子，國聯的軍隊対日本人的軍隊都不敢小看了，都對日本這個軍：喔！這真是有尚武的精神，不怕死！所以一下子就把國聯行軍隊， 差不多都給嚇壞了。 那麼這樣子， 所以叫老虎， 𤅗洲虎， 它就像老虎那麼勇猛。 「渡海狼」，渡海是日本到中國，過一個海。它在本土就是一隻老虎，人畏之如虎，過了海怎麼樣？就變成狼了。那個狼比老虎更不講理，牠到處晚間出去，把小孩子，牠也吃；是小豬子，牠也給扛著，到處去偷人家的東西，來給牠自己做飯吃，這叫渡海狼。所以等到日本來侵略中國的時候，比這個虎還厲害，變成一隻狼了，無所不用其極，殺傷我們中國的同胞不知有多少，所以那時候「滿天紅日更昏黃」，有太陽了，可是太陽不清楚，昏昏暗暗的。這天上本是紅太陽，紅日，可是那時候變得黃澄澄的了，為什麼呢？日月無光了；昏黃，就日月無光了。所以這時候就把中國變成「莽莽神州傷破碎」，中國這個土地叫神州， 因為中國有很多人修行成神仙的， 所以叫神州， 神仙聚會的一個地方。 傷破碎， 這時候日本人在中國到處燒殺搶姦， 什麼時候都幹啦， 所以就傷破碎了。 「蒼生到處哭爺娘」，那時候的人都逃這個戰爭的災難，到處哭爺娘，小孩子到處叫爸爸、媽媽，都找不著家了，所以都流離失所。這種逃難的情形，顚沛流離，慘不忍睹的景象，這蒼生到處哭爺娘。 「春雷乍響見睛陽」，春雷就是原子彈， 這原子彈一響， 這是一聲春雷； 這一響， 這天又晴了， 又見到太陽了。 跟著這第六個，就是「西安事變」。西安事變這一條這樣說的： 細柳營中，群雄豪飲，月掩中秋，酣醉未醒，雙獅搏球，一墜其井，紅粉佳人，面靨櫻景。 這三個主角是蔣總統和張學良，還有蔣夫人宋美齡。「細柳營中」，這說的西安那個地方， 叫「細柳營」。 在細柳營那個軍營裏邊， 「群雄豪飲」， 這個時候， 張學良、 蔣介石、 楊虎城， 還有其他這個某某某， 那麼很多啦，群雄就是很多， 都是長得像人那樣子， 有頭有臉的，那麼大家在一起喝酒，群雄豪飲，群雄在那兒都喝酒。這是那一天呢？是中秋那一天，所以說「月掩中秋」， 還差一點，大約這個月亮， 被這個雲遮上了。 「酣醉未醒」，這個時候大家喝酒還都喝醉了，就睡覺了；可是「雙獅搏球」，這個西安事變呢，那時侯就有一個連長，叫什麽孫名九？是孫名十的？我是不知道，那麼就把蔣總統給抓起來了，這叫「雙獅搏球」。這時候兩個獅子在那兒博球呢！在那兒爭奪這個球。這個球是什麼呢？就是中國這塊地球，雙獅博球，都想搶這個球。可是「一墜其井」，有一隻獅子就沒小心，掉到井裏了。這個掉到井裏，也可以説是蔣總統先掉到井裏了；然後又可以說是將學良張將軍掉到井裏了。怎麼樣講，總而言之，蔣總統也掉過井裏，張學良也掉過井裏頭。這個時候掉到井裏的，可以說是蔣總統，那麼「紅粉佳人，面靨櫻景」，這時候紅粉佳人是我們在中國的蔣夫人宋美䶖女士。這個蔣夫人和宋子文，還有其他的人到那兒，到了西安，去和張學良講和。張學良也不是真想把蔣總統抓起來，他是想要以兵諫蔣總統。所以蔣夫人到那兒一說，張學良也是一個講義氣的人，就說：「好！那我送蔣主席回去。」於是乎就親身保護著蔣總統回到南京。回到南京，想不到那個獅子出了井了，這個獅子又掉到窟㝫裏了， 又被監禁五十多年， 這是一墜其井。 紅粉佳人， 到那兒笑一笑， 哭一哭， 把中國歷史就改變了。 那麼就這樣子呢， 這是西安事變的故事，也是在光緒三十年， 早就給預定了， 早就安排好了。 下一段就是說的日本投降了，說是： 春雷乍，豎白旗，千萬活鬼哭啼啼， 石頭城中飛符到，又見重整漢宮儀， 東山又有火光照。 「春雷乍」，這個原子彈一落了，日本無所措手的，無條件投降了，豎白旗了。「千萬活鬼哭啼啼」，這時候日本人都像個活鬼似的了，日本那個敢死的軍隊，都在那兒又哭嚎的，又有自殺的，又有不要命的，所以說千萬活鬼哭啼啼 。日本人本來都有尚武精神，雄赳赳的，赳赴武夫，到處耀武揚威的，這個虎狠之師，虎狠的兵，到處很威風的；可是這一投降，無條件投降，就都哭起來了。千萬活鬼了，那個咸也都没有了，那個武勇也都不知跑到那兒去了，所以千萬活鬼哭啼啼。那時候他因為投降了，中國人就欺負他們，因為他們來侵略中國，殺中國的同胞，不計其數，中國人當時就想報仇。我對大家曾經這麼說過，我說：「你們不要把日本人看低了，不要小看日本人，再二十年之后，日本還是國際間的一個強國。」為什麼我這樣說呢？因為日本人雖然戰敗了，但是它這個民心團結、愛國，它總要想法子再強盛起來。那麼二十年之后，日本人以經濟的戰術來壓倒全世界，又成為強國了。 所以說這個「石頭城中飛符到」，石頭城就是南京、金陵，它有另外的一個名字叫石頭城。「飛符到」，就是南京下命令了，下什麼命令？要慶賀八年抗戰勝利了，所以下命令教大家都去慶祝勝利的成功。 「又見重整漢宮儀」，這時候因為慶祝勝利就長衫、馬褂啊，中國禮儀之邦，這個禮儀三百，威儀三千啊！又都出現了。可是大家要知道，「東山又有火光照」，在東山那個地方又起來一把火，這一把火是什麽呢？這東山哪！就是說的毛澤東。毛澤東在東山那個地方，成立八路軍；林彪這個狼帶著一班狼，所以就好像火光似的，這火光也就是紅色的共產黨，東山這個火光又起來了。 下一個說到中國共產黨出現了，就是說的 日月蝕，五星稀，二七交加挂彩衣， 野人舉足迫金虎，遍地紅花遍地飢， 富貴貧賤無高低。 你聽聽! 這不是共產黨的口號是什麼? 這個「日月蝕，五月稀」, 這言其這個時候啊， 將要黑天了， 雖然有太陽， 也在那兒日蝕、月蝕，日月無光了。「五星稀」，這個星星也很稀少的。這五星稀呢？就是共產黨這個旗， 叫五星旗。 這曰月蝕就是這個青天白日旗沒有了， 可是這個五星稀，五星旗也不多 , 就是在地下工作， 還沒有普遍。 可是啊！「二七交加掛彩衣」，這個「二」字底下加個「七」字，合起來就是「毛」字，很顯著地就提起來這毛澤東來了。「二七交加掛彩衣」，這就隱藏著「毛澤」這兩個字在裏頭。這個「毛」字掛上彩衣了，這個彩衣, 他有彩色； 那個「澤」是潤澤， 潤澤也有點光彩的意思， 這叫掛彩衣。 「野人舉足迫金虎」，什麼叫野人呢？野人是沒文化的人，就是工人，農人和這個軍人八路軍。迫金虎，他們到處清算大地主，這就是野人舉足，抬起腳來踢這金老虎。什麼叫做金老虎？就是大地主。共產黨叫大地主叫金老虎， 因為他很多錢， 他剝削人民， 所以說這個叫老虎， 金老虎。 野人舉足迫金虎， 迫就是壓迫， 雖然是野人， 可是金老虎怕這個野人， 他不講道理。 「遍地紅花遍地飢」， 這個時候全中國都變成赤色了， 赤色共產了， 所以遍地都好像開紅花似的。 遍地飢，這個「飢」不是雞鴨那個「雞」。雞鴨那個雞，你說遍地都是雞鴨，也不用養也不用餵㸱， 到時候我把牠抓來， 就殺着吃肉。 不是這樣子， 是飢餓的飢。 遍地都是紅花， 可是遍地的人民哪， 都挨餓。 「富貴貧賤無高低」， 這時侯共產黨的口號是「無富無貧，人人有飯吃，個個有工做。」 那麼無高低、 可是他們一成功了，又搞種種特權，這個富貴貧賤比以前更大相懸殊。這一段是說這個毛澤東。 我記得，我沒有離開東北的時候，那時候地方已經有共產黨的地下工作人員。我那時候是個出家人，己經出家了，他就向我宣傳共產黨的好處，説怎麼樣大家都平等啦，財產可以互相均分、平等、共產，大家都有飯吃， 大家都有衣服穿， 大家都有工作， 大家無論如何都是一樣的， 沒有富的， 也沒有窮的， 平等平等的。 我當時也就沒有加思索， 說出一番理論來， 我說你共產只是能共有形的產，可是無形的財產，你共不了，你沒有法子共的。他說什麼呢？我說譬如這個房子、地、財產，你可以共，你可以分。可是人本身固有的財產，你就分不了的，你也共不了的。什麼呢？譬如拿眼睛來講，你若真共產，那個瞎子你也應該共給他一個眼睛，我問你們共產黨，哪一個願意共一個眼睛給那個瞎子的？他不講話。我說這眼睛沒有人肯共，就有人肯共，也只是一個、兩個人的可以共，不能全共；可是你的眼睛共給他，放到他眼睛上，也不一定再能看得見，他還是沒有這個財產的資本。耳朵你能聽，他就是聾子，你會不會把你的耳朵共他一個，令他也有耳朵的財產呢？會不會這樣？我說啞吧，他不會講話，你會不會把你的舌頭共給他一半？你把你的舌頭共給他一半，你自己也不會講話了，兩個都成啞吧了。你若共眼睛，兩個人都瞎了；共耳朵，兩個人都變聾子了。甚至於胳臂、腿，全身的五官都是這樣子，你能不能共呢？把他說得沒有什麼話講，就回去。回去，第二天很早就起來了，來了說：「欵！你昨天講的話，很有理由的。可是你這樣人也很少的，你現在應該出來為國家做事，也創革命，同我們一起來創作共產黨。」教我也參加共產黨， 我一想，我也沒有產可共， 我也不願共人的產， 再者說我生來就什麼都不要的，我也不願共人產，人家也不要共我的產，我也沒有產可共。 我說等我考慮考慮吧！為國家服務也是好的， 我考慮考慮。 那麼他走了， 第二天我也走了。 由那時， 我就一步一步地走到美國來， 可是從香港到美國是坐飛機來的。 下一段就説的臺灣了。 臺灣這怎麼樣說呢？ 就說： 二七縱橫，一牛雙尾，無復人形，日行恆匭，海上金鰲，玄服律呂，鐵鳥凌空，東南盡毀。 「二七縱橫」，這也就是形容毛澤東初得到大陸主權的時候，他就縱橫不可一世，在天安門上，他就說：「中國人民要站起來！」這表示他前無古人，后無來者，那麼他這個躊躇滿志，所以說「二七縱橫」。 12 「一牛雙尾」，你們各位看見過沒看見過，一個牛兩個尾巴？你看奇怪不奇怪？這真是個怪物。這不是一個牛兩個尾巴，是一個「牛」字下邊有兩撇，這是個「朱」字。「二七」就是毛澤東，「一牛雙尾」就是朱德，所以那時候稱「朱毛！朱毛！」「無復人形」，這不像個人的樣子。「日行恆匭」，可是這時候還是日月照常這麼轉轉，一天一天地人民也這麼過去了，也沒有改變多大的情形。 「海上金鰲」，就是說的台灣。台灣這塊土地就像個鰲魚似的，所以這回佛法也發達了，就好像觀音菩薩腳踩著鰲魚在這個地方，台灣的佛法，由大陸到台灣的出家人很多，所以說海上金鰲。 「玄服律呂」，玄服，都是穿著黑禮服。律呂，奏著音樂、唱歌，這是永慶昇平，過太平的日子。可是「鐵鳥凌空，東南盡毀」，鐵鳥就是飛機。凌空，飛機飛到空中。還記得這個共產黨在四幾年？是五幾年？就用飛機來想要試探台灣的軍事情形，可是台灣這兒有響尾蛇飛彈，就把它飛機給打落了。打落了之后，它再也不敢來突襲了，再也不敢來炸了，所以這叫鐵鳥凌空。「東南盡毀」，東南毀就是和大陸斷絕關系了，沒有交通了，幾十年都是這樣生活，這樣地繁榮。 下一段就是說的： 紅霞蔚，白雲蒸，落花流水兩無情， 四海水中皆赤色，白骨如丘滿崗陵， 相將玉兔漸東升。 這幾句大約就是說的現在。「紅霞蔚」，共產黨本來是紅色的，它也變成藍色了，這也就是共產主義變成資本主義了。這就是它現在的情形，門戶開放，現在中國不是也稱經濟大國了。所以變藍色，藍色就不紅了。藍色就是人吃喝玩樂，很多錢的，像現在大陸一樣的，大陸現在拼命地吃，拼命地享受。共產黨本來是紅色，現在變成藍色了，它要變了才能改了。「白雲蒸」，白雲就是青天白日旗，也就是國民黨。白雲蒸，就是說國民黨像一朵白雲似的，沒有了，蒸發掉了，都在虛空裡化為烏有，變成蒸氣了。 所以說「落花流水兩無情」，落花，一個共產主義；流水，一個國民黨，這兩個都互相沒有情面的，都不是誠意的，都是互相欺騙的。兩無情，誰對誰也都不客氣的，所以他們的勢力都差不多沒有了，兩無情了，都你也不讓步，他也不讓步，所以「四海水中皆赤色」，四海海水都變紅的了，這是血染成河了。「白骨如丘滿崗陵」，死的人骨頭像山丘那麼多，在滿山遍野都是人的骨頭。 「相將玉兔漸東升」，因為這個亂極，大家就該思治了，所以這個時候，又漸漸地恢復好了。玉兔就是月亮，漸漸地就在東邊升起來了；月亮漸漸地發出光輝來了，所以又再見到真正的月光了。 然后，下一段又說： 棺蓋定，功罪分，茫茫海宇見承平， 百年大事渾如夢，南朝金粉太平春， 萬裡山河處處青。 這個時候，中國要有太陽出來了，就國泰民安，風調雨順了。「棺蓋定」，就是都死了，蓋棺論定。「功罪分」，那時候誰有功也判斷出來了，誰有過也判斷出來了，歷史都分別得很清楚。「茫茫海宇見承平」，這個時候就該太平了，「物極必反，否極泰來」，就這個極亂的時候，又平定了；平定到極點，又該亂了。古往今來在中國的國運就是一興一衰、一治一高亂，那麼五百年必有王者興，其間必有名士者。茫茫海宇，也就是中國這麼大的一塊土地啊，茫茫無邊、沒有邊際的這個㨾子，可以見到要太平了。「百年大事渾如夢」，從清朝的末季到現在將近一百年了，其中發生的這種大事就像作夢似的。 「南朝金粉太平春」，將來又建都在南京，這南朝指的就是南京，又像歌舞昇平的時候，歌樂弦管，在南京那兒歡樂起來了，南京那時又是永慶昇平，民安物阜，國泰民安，人人都豐衣足食的；太平春，這時候是很好的時候。金粉是指南京船上的女人，專門唱歌來招待客人呀、喝酒陪唱，像以前富麗豪華的場面又會回來了，這都是一定的。 「萬裡山河處處青」，就是到處都注重青色的服裝了，將來取代共產黨的這個軍隊，都是注重青色的。青色就表示哀悼，所以這是這個軍隊表示哀悼、吊民伐罪的意思。吊民伐罪就是認為對方暴虐得太厲害了，所以要替老百姓來平反。 處處青，就是人穿的衣服、軍隊穿的衣服，都是青色的。這是所有的萬裡山河都是軍隊所佔領了，所以說萬裡山河處處青。這軍隊是將來新出來的軍隊，不是共產黨，也不是國民黨，可是還是在這裡頭脫出來的。這一治一亂，一興一衰，這是國家的一個國運。 唐高祖，起義師；除隋亂，創國基。 這也就是一時崛起，也就像中華民國剛一開始，黎元洪在那兒起義，八方響應一樣的道理。 下面那一段就說的： 世宇三分，有聖人出， 玄色其冠，龍彰其服， 日月復明，處治萬物， 四海謳歌，蔭受其福。 「世宇三分」，這不是單單說的中國了，這是三個大國來領導世界，這叫世宇三分。哪三個大國這沒有一定的，或者美國、中國和日本，或者蘇聯、日本和中國。總而言之，中國是其中一個，就由三個大國分治這個天下、管理這個天下。 「有聖人出」，中國會出聖人。 「玄色其冠」，這個人戴著黑帽子。「龍彰其服」，彰就是彰明表着，很顯眼的地方。龍彰是以龍做標誌，就是以龍做這個肩章。一般隊伍都有肩章，五星上將都有肩章；这是他那個肩章上有龍。「日月復明」，就是天又正常了，太陽又露出來了，这時候天地又重新現出光明了。「處治萬物」，这時候聖人來管理世界，他日理萬机，为世界人類謀幸福，因为他為大衆老百姓作想，給人民謀幸福，所以「四海謳歌」，就是大家都歌舞升平，都在那兒安居樂業，大家都過著快樂的日子，沒有這麼憂愁煩惱了。 「蔭受其福」，那么世界所有的人類，都受这個聖人的福蔭，來覆盖着他们，所謂「一人有慶，兆民賴之」，这一個人若是聰明了，这所有世上的老百姓，都是得到他福報的光明照耀。所以我們中國在二十一世紀會領導世界，不過大家要往好的做，會領導世界；若不往好的做，這可能啊，就都不存在了；因為外國都在那兒虎視耽耽地看著中國，你什麼時候沒有力量，分散了、分裂了，所謂「蛤蚌相爭，漁翁得利。」你若好好做嘛！中國人將來是領導世界的；若不好好做，不往那個光明的途上走啊，恐怕是要被人家領導了。 以上这是步虚大师所说的这個詞，下边他又说了四句詩之類的，他説： 茫茫天數本難知，惟在蒼生感太虛，老僧不敢多饒舌，洩漏天機恐被誅。 「茫茫天數本難知」，这又是说到這個天數，就是茫茫沒有边際這個道理，無窮盡这個道理，本来不容易知道的。 「惟在蒼生感太虛」，那麽这不管你知道不知道，你也不管它有多大，你就眾生都改恶向善，就能感動天地，令天地就平安了，天地有祥和之氣。說 「老僧不敢多饒舌」，這個步虛大師他就说，說老僧我啊！我不敢多说太多的话。 「洩漏天機恐被誅」，我如果把这個天機完全都洩露了，恐怕被天打雷劈，被天譴，被天来懲罰我！ 這是近百年大略的中國的風雲人物。我希望我們大家都不要忘了國，不要忘了家，不要忘了自身的健康。所以既要愛自身，也要愛家，又要愛國，這是我對台灣所有善知識的希望。 為什麼講這個給大家聽？就是教大家覺悟：這一切一切都是天數，是注定的。人不過像個機器似的，被天地在那兒支配，就這麼顛顛倒倒的，做一些泯滅良心的事，在那兒爭權奪利。其實你爭也是這麼回事，不爭還是這麼回事，大家應該學學步虛大師，不在這裡爭名奪利，趕快去修行去了。","categories":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/categories/%E7%8E%84%E5%AD%A6/"}],"tags":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/tags/%E7%8E%84%E5%AD%A6/"},{"name":"宣化上人","slug":"宣化上人","permalink":"http://mingliang233.com/tags/%E5%AE%A3%E5%8C%96%E4%B8%8A%E4%BA%BA/"}]},{"title":"《渔樵问对》原文","slug":"渔樵问对","date":"2020-07-27T12:46:25.000Z","updated":"2020-07-27T15:00:25.000Z","comments":true,"path":"2020/07/27/渔樵问对/","link":"","permalink":"http://mingliang233.com/2020/07/27/%E6%B8%94%E6%A8%B5%E9%97%AE%E5%AF%B9/","excerpt":"","text":"渔者垂钓于伊水之上。樵者过之，弛担息肩，坐于磐石之上，而问于渔者。曰：“鱼可钩取乎？”曰：“然。”曰：“钩非饵可乎？”曰：“否。”曰：“非钩也，饵也。鱼利食而见害，人利鱼而蒙利，其利同也，其害异也。敢问何故？”渔者曰：“子樵者也，与吾异治，安得侵吾事乎？然亦可以为子试言之。彼之利，犹此之利也；彼之害，亦犹此之害也。子知其小，未知其大。鱼之利食，吾亦利乎食也；鱼之害食，吾亦害乎食也。子知鱼终日得食为利，又安知鱼终日不得食为害？如是，则食之害也重，而钩之害也轻。子知吾终日得鱼为利，又安知吾终日不得鱼不为害也？如是，则吾之害也重，鱼之害也轻。以鱼之一身，当人之食，是鱼之害多矣；以人之一身，当鱼之一食，则人之害亦多矣。又安知钓乎大江大海，则无易地之患焉？鱼利乎水，人利乎陆，水与陆异，其利一也；鱼害乎饵，人害乎财，饵与财异，其害一也。又何必分乎彼此哉！子之言，体也，独不知用尔。”樵者又问曰：“鱼可生食乎？”曰：“烹之可也。”曰：“必吾薪济子之鱼乎？”曰：“然。“曰：“吾知有用乎子矣。”曰：“然则子知子之薪，能济吾之鱼，不知子之薪所以能济吾之鱼也。薪之能济鱼久矣，不待子而后知。苟世未知火之能用薪，则子之薪虽积丘山，独且奈何哉？”樵者曰：“愿闻其方。”曰：“火生于动，水生于静。动静之相生，水火之相息。水火，用也；草木，体也。用生于利，体生于害。利害见乎情，体用隐乎性。一性一情，圣人能成。子之薪犹吾之鱼，微火则皆为腐臭败坏，而无所用矣，又安能养人七尺之躯哉？”樵者曰：“火之功大于薪，固已知之矣。敢问善灼物，何必待薪而后传？”曰：“薪，火之体也。火，薪之用也。火无体，待薪然后为体；薪无用，待火然后为用。是故凡有体之物，皆可焚之矣。”曰：“水有体乎？”曰：“然。”曰：“火能焚水乎？“曰：“火之性，能迎而不能随，故灭。水之体，能随而不能迎，故热。是故有温泉而无寒火，相息之谓也。”曰：“火之道生于用，亦有体乎？”曰：“火以用为本，以体为末，故动。水以体为本，以用为末，故静。是火亦有体，水亦有用也。故能相济又能相息，非独水火则然，天下之事皆然，在乎用之何如尔。”樵者曰：“用可得闻乎？”曰：“可以意得者，物之性也。可以言传者，物之情也。可以象求者，物之形也。可以数取者，物之体也。用也者，妙万物为言者也，可以意得，而不可以言传。”曰：“不可以言传，则子恶得而知之乎？”曰：“吾所以得而知之者，固不能言传，非独吾不能传之以言，圣人亦不能传之以言也。”曰：“圣人既不能传之以言，则六经非言也耶?”曰：“时然后言，何言之有？”樵者赞曰：“天地之道备于人，万物之道备于身，众妙之道备于神，天下之能事毕矣，又何思何虑！吾而今而后，知事心践形之为大。不及子之门，则几至于殆矣。”乃析薪烹鱼而食之，饫而论《易》。渔者与樵者游于伊水之上。渔者叹曰：“熙熙乎万物之多，而未始有杂。吾知游乎天地之间，万物皆可以无心而致之矣。非子则孰与归焉？”樵者曰：“敢问无心致天地万物之方？”渔者曰：“无心者，无意之谓也。无意之意，不我物也。不我物，然后定能物物。”曰：“何谓我，何谓物？”曰：‘以我徇物，则我亦物也；以物徇我，则物亦我也。我物皆致，意由是明。天地亦万物也，何天地之有焉？万物亦天地也，何万物之有焉？万物亦我也，何万物之有焉？我亦万物也，何我之有焉？何物不我？何我不物？如是则可以宰天地，可以司鬼神，而况于人乎？况于物乎？“樵者问渔者曰：“天何依？”曰：“依乎地。”曰：“地何附？”曰：“附乎天。”曰：“然则天地何依何附？”曰：“自相依附。天依形，地附气。其形也有涯，其气也无涯。有无之相生，形气之相息。终则有始，终始之间，其天地之所存乎？天以用为本，以体为末；地以体为本，以用为末。利用出入之谓神，名体有无之谓圣。唯神与圣，能参乎天地者也。小人则日用而不知，故有害生实丧之患也。夫名也者，实之客也；利也者，害之主也。名生于不足，利丧于有余。害生于有余，实丧于不足。此理之常也。养身者必以利，贪夫则以身殉，故有害生焉。立身必以名，众人则以身殉名，故有实丧焉。窃人之财谓之盗，其始取之也，唯恐其不多也。及其败露也，唯恐其多矣。夫贿之与赃，一物而两名者，利与害故也。窃人之美谓之徼，其始取之也，唯恐其不多也。及其败露，唯恐其多矣。夫誉与毁，一事而两名者，名与实故也。凡言朝者，萃名之地也；市者，聚利之地也。能不以争处乎其间，虽一日九迁，一货十倍，何害生实丧之有耶？是知争也者取利之端也，让也者趋名之本也。利至则害生，名兴则实丧。利至名兴，而无害生实丧之患，唯有德者能之。天依地，地会天，岂相远哉！”渔者谓樵者曰：“天下将治，则人必尚行也；天下将乱，则人必尚言也。尚行，则笃实之风行焉；尚言，则诡谲之风行焉。天下将治，则人必尚义也；天下将乱，则人必尚利也。尚义，则谦让之风行焉；尚利，则攘夺之风行焉。三王，尚行者也；五霸，尚言者也。尚行者必入于义也，尚言者必入于利也。义利之相去，一何如是之远耶？是知言之于口，不若行之于身，行之于身，不若尽之于心。言之于口，人得而闻之，行之于身，人得而见之，尽之于心，神得而知之。人之聪明犹不可欺，况神之聪明乎？是知无愧于口，不若无愧于身，无愧于身，不若无愧于心。无口过易，无身过难，无身过易，无心过难。既无心过，何难之有！吁，安得无心过之人，与之语心哉！”渔者谓樵者曰：“子知观天地万物之道乎？”樵者曰：“未也。愿闻其方。”渔者曰：“夫所以谓之观物者，非以目观之也，非观之以目，而观之以心也；非观之以心，而观之以理也。天下之物，莫不有理焉，莫不有性焉，莫不有命焉。所以谓之理者，穷之而后可知也；所以谓之性者，尽之而后可知也；所似谓之命者，至之而后可知也。此三知也，天下之真知也，虽圣人无以过之也。而过之者，非所以谓之圣人也。夫鉴之所以能为明者，谓其能不隐万物之形也。虽然鉴之能不隐万物之形，未若水之能一万物之形也。虽然水之能一万物之形，又未若圣人之能一万物情也。圣人之所以能一万物之情者，谓其圣人之能反观也。所以谓之反观者，不以我观物也。不以我观物者，以物观物之谓也。又安有我于其间哉？是知我亦人也，人亦我也。我与人皆物也。此所以能用天下之目为己之目，其目无所不观矣。用天下之耳为己之耳，其耳无所不听矣。用天下之口为己之口，其口无所不言矣。用天下之心为己之心，其心无所不谋矣。天下之观，其于见也，不亦广乎？天下之听，其于闻也，不亦远乎？天下之言，其于论也，不亦高乎？天下之谋，其于乐也，不亦大乎？夫其见至广，其闻至远，其论至高，其乐至大，能为至广、至远、至高、至大之事，而中无一为焉，岂不谓至神至圣者乎？非唯一时之天下谓之至神至圣者乎，而千万世之天下谓之至神至圣者乎。非唯一时之天下渭之至神至圣者乎，而千万世之天下谓之至神圣者乎。过此以往，未之或知也已。”樵者问渔者曰：“子以何道而得鱼？”曰：“吾以六物具而得鱼。”曰：“六物具也，岂由天乎？”曰：“具六物而得鱼者，人也。具六物而所以得鱼者，非人也。”樵者未达，请问其方。渔者曰：“六物者，竿也，纶也，浮也，沉也，钩也，饵也。一不具，则鱼不可得。然而六物具而不得鱼者，非人也。六物具而不得鱼者有焉，未有六物不具而得鱼者也。是知具六物者，人也。得鱼与不得鱼，天也。六物不具而不得鱼者，非天也，人也。”樵者曰：“人有祷鬼神而求福者，福可祷而求耶？求之而可得耶？敢问其所以。”曰：“语善恶者，人也；福祸者，天也。天道福善而祸淫，鬼神岂能违天乎?自作之咎，固难逃已。天降之灾，禳之奚益？修德积善，君子常分。安有余事于其间哉！”樵者曰：“有为善而遇祸，有为福而获福者，何也？”渔者曰：“有幸与不幸也。幸不幸，命也；当不当，分也。一命一分，人其逃乎？”曰：“何谓分？何谓命？”曰：“小人之遇福，非分也，有命也；当祸，分也，非命也。君子之遇祸，非分也，有命也；当福，分也，非命也。”渔者谓樵者曰：“人之所谓亲，莫如父子也；人之所渭疏，莫如路人也。利害在心，则父子过路人远矣。父子之道，天性也。利害犹或夺之，况非天性者乎？夫利害之移人，如是之深也，可不慎乎？路人之相逢则过之，固无相害之心焉，无利害在前故也。有利害在前，则路人与父子，又奚择焉？路人之能相交以义，又何况父子之亲乎？夫义者，让之本也；利者，争之端也。让则有仁，争则有害。仁与害，何相去之远也！尧、舜亦人也。桀、纣亦人也，人与人同而仁与害异尔，仁因义而起，害因利而生。利不以义，则臣弑其君者有焉，子弑其父者有焉。岂若路人之相逢，一目而交袂于中逵者哉！”樵者谓渔者曰：“吾尝负薪矣，举百斤而无伤吾之身，加十斤则遂伤吾之身，敢问何故？”渔者曰：“樵则吾不知之矣。以吾之事观之，则易地皆然。吾尝钓而得大鱼，与吾交战。欲弃之，则不能舍，欲取之，则未能胜。终日而后获，几有没溺之患矣。非直有身伤之患耶？鱼与薪则异也，其贪而为伤则一也。百斤，力分之内者也，十斤，力分之外者也。力分之外，虽一毫犹且为害，而况十斤乎！吾之贪鱼亦何以异子之贪薪乎！”樵者叹曰：“吾而今而后，知量力而动者智矣哉！”樵者谓渔者曰：“子可谓知《易》之道矣。吾也问：《易》有太极，太极何物也？”曰：“无为之本也。”曰：“太极生两仪，两仪，天地之谓乎？”曰：“两仪，天地之祖也，非止为天地而已也。太极分而为二，先得一为一，后得一为二。一二谓两仪。”曰：“两仪生四象，四象何物也？”曰：“大象谓阴阳刚柔。有阴阳然后可以生天，有刚柔然后可以生地。立功之本，于斯为极。”曰：“四象生八卦，八卦何谓也？”曰：“谓乾、坤、离、坎、兑、艮、震、巽之谓也。迭相盛衰终始于其间矣。因而重之，则六十四卦由是而生也，而《易》之道始备矣。”樵者问渔者曰：“复何以见天地之心乎？”曰：“先阳已尽，后阳始生，则天地始生之际。中则当日月始周之际，末则当星辰始终之际。万物死生，寒署代谢，昼夜变迁，非此无以见之。当天地穷极之所必变，变则通，通则久，故《象》言‘先王以至日闭关，商旅不行，后不省方’，顺天故也。”樵者谓渔者曰：“无妄，灾也。敢问何故？”曰：“妄则欺他，得之必有祸，斯有妄也，顺天而动，有祸及者，非祸也，灾也。犹农有思丰而不勤稼稿者，其荒也，不亦祸乎？农有勤稼穑而复败诸水旱者，其荒也，不亦灾乎？故《象》言‘先王以茂对时育万物’，贵不妄也。”樵者问曰：“姤，何也？”曰：“姤，遇也。柔遇刚也，与夬正反。夬始逼壮，姤始遇壮，阴始遇阳，故称姤焉。观其姤，天地之心，亦可见矣。圣人以德化及此，罔有不昌。故《象》言‘施命诰四方’，履霜之慎，其在此也。”渔者谓樵者曰：“春为阳始，夏为阳极，秋为阴始，冬为阴极。阳始则温，阳极则热；阴始则凉，阴极则寒。温则生物，热则长物，凉则收物，寒则杀物。皆一气别而为四焉。其生万物也亦然。”樵者问渔者曰：“人之所以能灵于万物者，何以知其然耶？”渔者对曰：“谓其目能收万物之色，耳能收万物之声，鼻能收万物之气，口能收万物之味。声色气味者，万物之体也。目耳口鼻者，万人之用也。体无定用，惟变是用。用无定体，惟化是体。体用交而人物之道于是乎备矣。然则人亦物也，圣亦人也。有一物之物，有十物之物，有百物之物，有千物之物，有万物之物，有亿物之物，有兆物之物。生一一之物，当兆物之物者，岂非人乎！有一人之人，有十人之人，有百人之人，有千人之人，有万人之人，有亿人之人，有兆人之人。当兆人之人者，岂非圣乎！是知人也者，物之至者也。圣也者，人之至者也。物之至者始得谓之物之物也。人之至者始得谓之人之人也。夫物之物者，至物之谓也。人之人者，至人之谓也。以一至物而当一至人，则非圣人而何？人谓之不圣，则吾不信也。何哉？谓其能以一心观万心，一身观万身，一物观万物，一世观万世者焉。又谓其能以心代天意，口代天言，手代天工，身代天事者焉。又谓其能以上识天时，下尽地理，中尽物情，通照人事者焉。又谓其能以弥纶天地，出入造化，进退今古，表里人物者焉。噫！圣人者，非世世而效圣焉。吾不得而目见之也。虽然吾不得而目见之，察其心，观其迹，探其体，潜其用，虽亿万千年亦可以理知之也。人或告我曰：‘天地之外，别有天地万物，异乎此天地万物。’则吾不得而知之也。非唯吾不得而知之也，圣人亦不得而知之也。凡言知者，谓其心得而知之也。言言者，谓其口得而言之也。既心尚不得而知之，口又恶得而言之乎？以不可得知而知之，是谓妄知也。以不可得言而言之，是谓妄言也。吾又安能从妄人而行妄知妄言者乎！”渔者谓樵者曰：“仲尼有言曰：殷因于夏礼，所捐益可知也；周因于殷礼，所损益可知也。其或继周者，虽百世可知也。夫如是，则何止于百世而已哉！亿千万世，皆可得而知之也。人皆知仲尼之为仲尼，不知仲尼之所以为仲尼，不欲知仲尼之所以为仲尼则已，如其必欲知仲尼之所以为仲尼，则舍天地将奚之焉？人皆知天地之为天地，不知天地之所以为天地。不欲知天地之所以为天地则已，如其必欲知天地之所以为天地，则舍动静将奚之焉？夫一动一静者，天地至妙者欤？夫一动一静之间者，天地人至妙者欤？是知仲尼之所以能尽三才之道者，谓其行无辙迹也。故有言曰：‘予欲无言’，又曰：‘天何言哉！四时行焉，百物生焉。’其此之谓与？”渔者谓樵者曰：“大哉！权之与变乎？非圣人无以尽之。变然后知天地之消长，权然后知天下之轻重。消长，时也；轻重，事也。时有否泰，事有损益。圣人不知随时否泰之道，奚由知变之所为乎？圣人不知随时损益之道，奚由知权之所为乎？运消长者，变也；处轻重者，权也。是知权之与变，圣人之一道耳。”樵者问渔者曰：“人谓死而有知，有诸？”曰：“有之。”曰：“何以知其然？”曰：“以人知之。”曰：“何者谓之人？”曰：“目耳鼻口心胆脾肾之气全，谓之人。心之灵曰神，胆之灵曰魄，脾之灵曰魂，肾之灵曰精。心之神发乎目，则谓之视；肾之精发乎耳，则谓之听；脾之魂发乎鼻，则谓之臭；胆之魄发乎口，则谓之言。八者具备，然后谓之人。夫人也者，天地万物之秀气也。然而亦有不中者，各求其类也。若全得人类，则谓之曰全人之人。夫全类者，天地万物之中气也，谓之曰全德之人也。全德之人者，人之人者也。夫人之人者，仁人之谓也。唯全人，然后能当之。人之生也，谓其气行，人之死也，谓其形返。气行则神魂交，形返则精魄存。神魂行于天，精魄返于地。行于天，则谓之曰阳行；返于地，则谓之曰阴返。阳行则昼见而夜伏者也，阴返则夜见而昼伏者也。是故知日者月之形也，月者日之影也。阳者阴之形也，阴者阳之影也。人者鬼之形也，鬼者人之影也。人谓鬼无形而无知者，吾不信也。”樵者问渔者曰：“小人可绝乎？”曰： “不可。君子禀阳正气而生，小人禀阴邪气而生。无阴则阳不成，无小人则君子亦不成，唯以盛衰乎其间也。阳六分，则阴四分；阴六分，则阳四分。阳阴相半，则各五分矣。由是知君子小人之时有盛衰也。治世则君子六分。君子六分，则小人四分，小人固不能胜君子矣。乱世则反是，君君，臣臣，父父，子子，兄兄，弟弟，夫夫，妇妇，谓各安其分也。君不君，臣不臣，父不父，子不子，兄不兄，弟不弟，夫不夫，妇不妇，谓各失其分也。此则由世治世乱使之然也。君子常行胜言，小人常言胜行。故世治则笃实之士多，世乱则缘饰之士众。笃实鲜不成事，缘饰鲜不败事。成多国兴，败多国亡。家亦由是而兴亡也。夫兴家与兴国之人，与亡国亡家之人，相去一何远哉！”樵者问渔者曰：“人所谓才者，有利焉，有害焉者，何也？”渔者曰：“才一也，利害二也。有才之正者，有才之不正者。才之正者，利乎人而及乎身者也；才之不正者，利乎身而害乎人者也。”曰：“不正，则安得谓之才？”曰：“人所不能而能之，安得不谓之才？圣人所以异乎才之难者，谓其能成天下之事而归之正者寡也。若不能归之以正，才则才矣，难乎语其仁也。譬犹药疗疾也，毒药亦有时而用也，可一而不可再也，疾愈则速已，不已则杀人矣。平药则常日而用之可也，重疾非所以能治也。能驱重疾而无害人之毒者，古今人所谓良药也。《易》曰：‘大君有命，开国承家，小人勿用。’如是，则小人亦有时而用之。时平治定，用之则否。《诗》云：‘它山之石，可以攻玉。’其小人之才乎！”樵者谓渔者曰：“国家之兴亡，与夫才之邪正，则固得闻命矣。然则何不择其人而用之？”渔者曰：“择臣者，君也；择君者，臣也。贤愚各从其类而为。奈何有尧舜之君，必有尧舜之臣；有桀纣之君，而必有桀纣之臣。尧舜之臣，生乎桀纣之世，桀纣之臣，生于尧舜之世，必非其所用也。虽欲为祸为福，其能行乎？夫上之所好，下必好之。其若影响，岂待驱率而然耶？上好义，则下必好义，而不义者远矣；上好利，下必好利，而不利者远矣。好利者众，则天下日削矣；好义者众，则天下日盛矣。日盛则昌，日削则亡。盛之与削，昌之与亡，岂其远乎？在上之所好耳。夫治世何尝无小人，乱世何尝无君子，不用则善恶何由而行也。”樵者曰：“善人常寡，而不善人常众；治世常少，乱世常多，何以知其然耶？”曰：“观之于物，何物不然？譬诸五谷，耘之而不苗者有矣。蓬莠不耘而犹生，耘之而求其尽也，亦未如之何矣。由是知君子小人之道，有自来矣。君子见善则喜之，见不善则远之；小人见善则疾之，见不善则喜之。善恶各从其类也。君子见善则就之，见不善则违之；小人见善则违之，见不善则就之。君子见义则迁，见利则止；小人见义则止，见利则迁。迁义则利人，迁利则害人。利人与害人，相去一何远耶？家与国一也，其兴也，君子常多而小人常鲜；其亡也，小人常多而君子常鲜。君子多而去之者，小人也；小人多而去之者，君子也。君子好生，小人好杀。好生则世治，好杀则世乱。君子好义，小人好利。治世则好义，乱世则好利。其理一也。”钓者谈已，樵者曰：“吾闻古有伏羲，今日如睹其面焉。”拜而谢之，及旦而去。","categories":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/categories/%E7%8E%84%E5%AD%A6/"}],"tags":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/tags/%E7%8E%84%E5%AD%A6/"},{"name":"邵雍","slug":"邵雍","permalink":"http://mingliang233.com/tags/%E9%82%B5%E9%9B%8D/"}]},{"title":"什么是函数式编程？","slug":"functional-programming","date":"2020-07-27T11:46:25.000Z","updated":"2020-07-27T15:00:25.000Z","comments":true,"path":"2020/07/27/functional-programming/","link":"","permalink":"http://mingliang233.com/2020/07/27/functional-programming/","excerpt":"","text":"函数式编程（以下简称FP）是一种编程范式，是一种软件构建的方式。与之相关的有面向对象编程和面向过程编程。 FP更倾向于代码的简洁，可预测，易测试。以下是FP的特性： 纯函数的组合什么是纯函数（pure functions）？ 纯函数的特点是： 给定同样的输入，总是获得同样的输出，并且没有副作用（ side-effects） 避免shared state什么是shared state？ shared state可以是全局作用域或者闭包作用域中的变量。 这样的shared state带来了一些问题。 检查代码不方便。比如，当我们要想弄清楚一个function的作用时，由于收到 shared state的影响，我们就要额外了解和这个shared state相关的一些操作。 可能引发一些条件竞争问题。函数调用的顺序变化可能影响执行结果。 Immutability不可变性不可变性是FP中强调的一个中心思想。不可变即一个对象一旦被声明就不能再更改。 避免side-effects任何引起了外部变化的函数都产生了side-effects 比如： Modifying any external variable or object property (e.g., a global variable, or a variable in the parent function scope chain) Logging to the console Writing to the screen Writing to a file Writing to the network Triggering any external process Calling any other functions with side-effects Reusability Through Higher Order Functions函数通过higher order function可以实现重用 A higher order function is any function which takes a function as an argument, returns a function, or both. Higher order functions are often used to: Abstract or isolate actions, effects, or async flow control using callback functions, promises, monads, etc… Create utilities which can act on a wide variety of data types Partially apply a function to its arguments or create a curried function for the purpose of reuse or function composition Take a list of functions and return some composition of those input functions Declarative vs ImperativeFP都是声明式的范式，意味着不会明确表现flow control Imperative是命令式，描述flow control：怎么做 declarative是声明式，描述data flow：做什么 下面是imperative: 123456789const doubleMap = numbers =&gt; &#123; const doubled = []; for (let i = 0; i &lt; numbers.length; i++) &#123; doubled.push(numbers[i] * 2); &#125; return doubled;&#125;;console.log(doubleMap([2, 3, 4])); // [4, 6, 8] 下面是declarative： 123const doubleMap = numbers =&gt; numbers.map(n =&gt; n * 2);console.log(doubleMap([2, 3, 4])); // [4, 6, 8] 总结函数式编程倾向以下几点： Pure functions 而不是 shared state 和side effects Immutability over mutable data 不可变 Function composition over imperative flow control 组合函数而不是 imperative flow control Lots of generic, reusable utilities that use higher order functions to act on many data types instead of methods that only operate on their colocated data Declarative rather than imperative code (what to do, rather than how to do it) Expressions over statements Containers &amp; higher order functions over ad-hoc polymorphism 参考文献精通javascript–什么是函数式编程https://medium.com/javascript-scene/master-the-javascript-interview-what-is-functional-programming-7f218c68b3a0","categories":[{"name":"变成范式","slug":"变成范式","permalink":"http://mingliang233.com/categories/%E5%8F%98%E6%88%90%E8%8C%83%E5%BC%8F/"}],"tags":[{"name":"Elixir","slug":"Elixir","permalink":"http://mingliang233.com/tags/Elixir/"},{"name":"函数式编程","slug":"函数式编程","permalink":"http://mingliang233.com/tags/%E5%87%BD%E6%95%B0%E5%BC%8F%E7%BC%96%E7%A8%8B/"}]},{"title":"《如何阅读一本书》摘要","slug":"How-To-Read-a-Book","date":"2020-07-26T12:46:25.000Z","updated":"2020-07-26T12:46:25.000Z","comments":true,"path":"2020/07/26/How-To-Read-a-Book/","link":"","permalink":"http://mingliang233.com/2020/07/26/How-To-Read-a-Book/","excerpt":"","text":"为什么要阅读如今是一个信息科技发达的时代，通过手机、电脑能让我们轻松方便地获取我们想要的信息。那如今阅读一本书是否还有必要呢？ 这里作者指出阅读的目标：Reading for information and Reading for Understanding 我认为，媒体视频、文章有助于我们在短时间内获得信息(information)。但阅读一本书与之相比，更加全面和系统。比如这本《如何阅读一本书》，从阅读的原因，层次，技巧到收获，就阅读这个话题进行了系统的论述。更重要的是通过阅读更容易让读者“ Reading for Understanding”。这是一篇文章或一段视频不能带来的。 阅读的层次(Level)作者将阅读划分了四个层次(level)。可以理解为级别。 第一层次：基础阅读基础阅读(elementary reading)。就是能读下来。能理解表层含义。 第二层次：检视阅读(Inspectional Reading)有选择地（系统地）去略读。比如给定一个有限时间，通过一些技巧快速的做完阅读。 检视阅读Ⅰ 有系统的略读(Skimming)或粗读(Pre-reading) 看TITLE PAGE和RREFACE 研究目录 检阅附有索引 阅读一下出版者的介绍 根据对内容的粗略印象 检视阅读Ⅱ 粗浅(Superficial)阅读 阅读的速读 逗留(Fixations)与回退(Regressions) 理解的问题 检视阅读总结 阅读速度提升了但是有没有助于更深的理解？ 第三层次：分析阅读分析阅读(Analytical reading)是一种透彻完整的阅读或尽力阅读(the best reading you can do)。我的通俗理解就是将一本书读透。 1.书的分类2.X-raying一本书3.与作者找出共通词义4.判断作者的住址5.公正评断一本书6.赞同或者反对作者7.辅助阅读 第四层次：主题阅读主题阅读(Syntopical reading)是作者定义的最高层次。他需要读者读了很多很多相关性强或不强的书籍。这是最难的也毫无疑问是最能带来收获的。 不同种类书的阅读技巧（待补充） 实用型书 想象文学 故事、戏剧与诗 历史书 科学与数学 哲学书 社会科学 一些感想 阅读的选择 在阅读一本书之前，先大概了解这本书是否是我们想要的。读完要有一定的思考和总结。如果看完一本书感觉毫无收获，那么一：可能这本书就不该读。二：这本书的”打开方式“有误。 阅读的收获 ”多读书,读好书,好读书“。想起之前很火的“流浪大师”沈巍。记得他说自己没什么特别的只是书读的多了。在这个信息爆炸的时代，信息极容易获取，但是也让人们不安和浮躁。人们追崇”大师“，是猎奇，也表达一种向往。对知识的向往。 阅读的习惯 任何习惯的养成都需要靠毅力长时间地坚持。当阅读成为一种兴趣，也逐渐会成为一种习惯。 日期：2020年7月26日 悦读者：Lee桑","categories":[{"name":"Reading","slug":"Reading","permalink":"http://mingliang233.com/categories/Reading/"},{"name":"Book","slug":"Reading/Book","permalink":"http://mingliang233.com/categories/Reading/Book/"}],"tags":[{"name":"Readings","slug":"Readings","permalink":"http://mingliang233.com/tags/Readings/"},{"name":"Abstract","slug":"Abstract","permalink":"http://mingliang233.com/tags/Abstract/"}]}],"categories":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/categories/%E7%8E%84%E5%AD%A6/"},{"name":"变成范式","slug":"变成范式","permalink":"http://mingliang233.com/categories/%E5%8F%98%E6%88%90%E8%8C%83%E5%BC%8F/"},{"name":"Reading","slug":"Reading","permalink":"http://mingliang233.com/categories/Reading/"},{"name":"Book","slug":"Reading/Book","permalink":"http://mingliang233.com/categories/Reading/Book/"}],"tags":[{"name":"玄学","slug":"玄学","permalink":"http://mingliang233.com/tags/%E7%8E%84%E5%AD%A6/"},{"name":"宣化上人","slug":"宣化上人","permalink":"http://mingliang233.com/tags/%E5%AE%A3%E5%8C%96%E4%B8%8A%E4%BA%BA/"},{"name":"邵雍","slug":"邵雍","permalink":"http://mingliang233.com/tags/%E9%82%B5%E9%9B%8D/"},{"name":"Elixir","slug":"Elixir","permalink":"http://mingliang233.com/tags/Elixir/"},{"name":"函数式编程","slug":"函数式编程","permalink":"http://mingliang233.com/tags/%E5%87%BD%E6%95%B0%E5%BC%8F%E7%BC%96%E7%A8%8B/"},{"name":"Readings","slug":"Readings","permalink":"http://mingliang233.com/tags/Readings/"},{"name":"Abstract","slug":"Abstract","permalink":"http://mingliang233.com/tags/Abstract/"}]}